Revit 2026 API

# FluidTypeIsFluidInUse Method

---

Identifies if the fluid type is in use.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsFluidInUse(
	Document document,
	ElementId fluidId
)
```
```vb
Public Shared Function IsFluidInUse (
	document As Document,
	fluidId As ElementId
) As Boolean
```
```cpp
public:
static bool IsFluidInUse(
	Document^ document,
	ElementId^ fluidId
)
```
```fsharp
static member IsFluidInUse :
        document : Document *
        fluidId : ElementId -> bool
```

#### Parameters

document Document
     The document.
fluidId ElementId
     The id of the fluid type.

#### Return Value

Boolean True if the fluid type is in use. False if the fluid type is not in use.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

If a fluid type is in use, it cannot be deleted.

#### Reference

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace